# _*_ coding: utf-8 _*_

from bpa.tokenizer import MyTokenizer


def test_batch_segment():
    import time
    texts = [
        "挖基坑土方 1.部位:沉箱 2.挖土深度:550mm",
        "零星砌砖 1.LC15陶粒混凝土填充层 2.15厚1:3水泥砂浆保护层 3.钢筋混凝土楼板扫水泥浆一道 4.部位:沉箱",
        "砌块墙 1.砌块品种、规格、强度等级:蒸压加气混凝土砌体 2.墙体类型:内墙 3.砂浆强度等级:预拌水泥砂浆M5.0 4.部位:变形缝",
        "栏板 1.部位:盥洗池 2.混凝土强度等级:C20商品混凝土",
        "现浇构件钢筋 1.钢筋种类、规格:圆钢φ10内",
        "金属(塑钢)门 1.门代号及洞口尺寸:M1（900*2100） 2.门框、扇材质:不锈钢扣板、磨砂玻璃门 3.玻璃品种、厚度:磨砂钢化玻璃8mm",
        "屋面卷材防水 1.卷材品种、规格、厚度:1.5厚合成高分子防水卷材 2.部位:屋面",
        "楼面变形缝 1.嵌缝材料种类:聚乙烯泡沫塑料棒 2.阻火带:不燃材料阻火带 3.标准图集:中南标11ZJ111（5/A-8) 4.50*50*3mm不锈钢角钢 5.0.8mm不锈钢接水槽",
        "保温隔热屋面 1.保温隔热材料品种、规格、厚度:SGK防水型隔热板（B节能型333×333×60mm厚度28mm30kg/m3） 2.结合层厚度、砂浆配合比:25mm1:4干硬性水泥砂浆",
        "保温隔热屋面 1.找坡:30厚(最薄处)1:8憎水性膨胀珍珠岩找坡 2.工程部位:屋面",
        "矩形柱 1.混凝土种类:泵送 2.混凝土强度等级:C30 3.周长:1.6米以内 4.泵送高度:30-50米 5.部位:楼梯间柱",
        "矩形柱（10F~14F）（楼梯柱） \"1.混凝土种类:预拌商品混凝土 2.混凝土强度等级:C30 3.:柱周长1.6m内，泵送高度超30m\"",
    ]
    tokenizer = MyTokenizer()
    t0 = time.time()
    for text in texts:
        print(tokenizer.segment(text))
    print("[INFO] Segment %d documents took %f seconds" % (len(texts), time.time() - t0))
